// ​‌‌‍⁡⁣⁢⁣Модуль 𝟭. Заняття 𝟮. Розгалуження. Цикли⁡​

// if (2 === 2) {
// 	console.log('+++')
// }

// const number = 160

// if (number < 100) {
// 	console.log('100')
// } else if (number < 150) {
// 	console.log('150')
// } else {
// 	console.log('else')
// }

// const number = 0

// if (!number) {
// 	console.log(100)
// }

// '' >>false
// 0
// false
// null
// undefined
// NaN

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ​‌‍‌⁡⁢⁢⁢Example 1 - Введення користувача та розгалуження⁡​

// Використовуючи конструкцію if..else та prompt, напиши код, який питатиме: "Яка офіційна назва JavaScript?". Якщо користувач вводить ECMAScript, то показуй alert з рядком "Правильно!", в іншому випадку - "Не знаєте? ECMAScript!"

// const messagePrompt = prompt('Яка офіційна назва JavaScript?')
// 	.toLowerCase()
// 	.trim()
// 	.replaceAll(' ', '')
// 	.replaceAll('.', '')
// // const currentMessageFromPrompt = messagePrompt.toLowerCase()
// console.log('messagePrompt :>> ', messagePrompt)
// const currentAnswer = 'ECMAScript'

// let message = ''
// if (messagePrompt === currentAnswer.toLowerCase()) {
// 	message = 'Good'
// } else {
// 	message = `Not correct! Current answer >>> ${currentAnswer}`
// }
// alert(message)
// console.log(prompt)
// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 2 - Відображення часу (if...else)​⁡

// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 г. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 г.", без хвилин.

// const hours = 14
// const minutes = 0

// if (minutes) {
// 	console.log(`${hours} г. ${minutes} хв.`)
// } else {
// 	console.log(`${hours} г.`)
// }

// if (minutes>0) {
// 	console.log(`${hours} г. ${minutes} хв.`)
// } else {
// 	console.log(`${hours} г.`)
// }

// if (!(minutes <= 0)) {
// 	console.log(`${hours} г. ${minutes} хв.`)
// } else {
// 	console.log(`${hours} г.`)
// }

// if (minutes === 0) {
// 	console.log(`${hours} г.`)
// } else {
// 	console.log(`${hours} г. ${minutes} хв.`)
// }

// console.log(timeString)

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ​‌‍‌⁡⁢⁢⁢Example 3 - Розгалуження⁡​

// Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь в консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt('Введіть число')

// console.log('message :>> ', message)

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 4 - Вкладені розгалуження⁡

// Напиши скрипт, який порівнює числа у змінних a та b. Якщо обидва значення більше 100, то виведи в консоль максимальне з них. В протилежному випадку у консолі повинна бути сума значення b та числа 512.

// const a = 180
// const b = -180

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ​‌‍‌⁡⁢⁢⁢Example 5 - Форматування посилання⁡​

// const number = 100

// if (number > 50) {
// 	if (number < 100) {
// 		if(number){}
// 	} else {
// 		console.log('object')
// 	}
// } else {
// 	console.log('object')
// }

// const age = 16

// if (age > 18 && age < 25) {
// 	console.log('welcome')
// } else {
// 	console.log('Old man')
// }

// if (age > 18) {
// 	if (age < 25) {
// 		console.log('welcome')
// 	} else {
// 		console.log('Old man')
// 	}
// }

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.

// let link = 'https://my-site.com/about/'

// console.log('link', link)

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 6 - Форматування посилання (includes та логічне «І»)​⁡

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site". Використовуй конструкцію if...else.

// let link = 'https://my-site.com/about'

// console.log(link)

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ​‌‍‌⁡⁢⁢⁢Example 7 - Форматування посилання (тернарний оператор)⁡​

// Виконай рефакторинг коду задачі номер 4, використовуючи тернарний оператор.

// let link = 'https://somesite.com/about'

// console.log(link)

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 8 - if...else та логічні оператори​⁡

// Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.
// Якщо значення змінної hours:
// -- менше 17, виводь рядок "Pending"
// -- більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// -- більше 24 , виводь рядок "Overdue"

// const hours = 10;

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 9 - Дедлайн здачі проекту (if...else)​⁡
// Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію if...else.

// Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
// Якщо до дедлайну 1 день - виведи рядок "Завтра"
// Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
// Якщо до дедлайну 3+ днів - виведи рядок "Дата у майбутньому"

// const daysUntilDeadline = 5;

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 10 - Дедлайн здачі проекту (switch)​⁡

// Виконай рефакторинг коду задачі номер 9 використовуючи switch.

// const daysUntilDeadline = 5

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 11 - Цикл for​⁡

// Напиши цикл for, який виводить у консоль браузера числа за зростанням від min до max, але тільки якщо число кратне 5.

// const max = 106
// const min = 3

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ⁡⁢⁢⁢​‌‍‌Example 12 - Введення користувача та розгалуження​⁡

// Напиши скрипт, який питатиме логін за допомогою prompt та логувати результат у консоль браузера.

// Якщо відвідувач вводить "Адмін", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"
// Пароль перевіряти так:

// Якщо введено пароль "Я адмін", то вивести рядок "Здрастуйте!"
// Інакше виводити рядок "Невірний пароль"

// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡
// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡
// ⁡⁢⁢⁢__________________________________________________________________________________________________________________________⁡

// ? :
// const number = 10

// if (number) {
// 	console.log(number)
// } else if (number > 100) {
// 	console.log('100')
// } else {
// 	console.log('object')
// }

// number
// 	? console.log(number)
// 	: number > 100
// 	? console.log('100')
// 	: console.log('object')

// if (number) console.log('object')
// else console.log('object')

// if (number) {
// 	console.log('object')
// 	console.log('correct')
// }

// const name = 'Alex'
// let currentName = ''

// name.includes('A')
// 	? (currentName = name.toLowerCase())
// 		? console.log('object')
// 		: console.log('error')
// 	: name.includes('a')
// 	? (currentName = name)
// 	: (currentName = name.toUpperCase())

// console.log('currentName :>> ', currentName)

// if (number > 100) {
// 	console.log(100)
// } else if (number > 50) {
// 	console.log(50)
// } else if (number < 150) {
// 	console.log(50)
// } else if (number > 350) {
// 	console.log(50)
// } else if (number > 450) {
// 	console.log(50)
// } else {
// 	console.log('some')
// }

// const number = 200

// switch (number) {
// 	case 100:
// 		console.log(100)
// 		break
// 	case 10:
// 		console.log(10)
// 		break
// 	case 50:
// 		console.log(50)
// 		break
// 	case 0:
// 		console.log(0)
// 		break

// 	default:
// 		console.log(number)
// 		break
// }

// scope

// if (10) {
// 	const x = 100
// 	console.log('x with if:>> ', x)
// }
// console.log('x :>> ', x)
